const scriptName = "식사 메뉴 추천";
/**
 * (string) room
 * (string) sender
 * (boolean) isGroupChat
 * (void) replier.reply(message)
 * (boolean) replier.reply(room, message, hideErrorToast = false) // 전송 성공시 true, 실패시 false 반환
 * (string) imageDB.getProfileBase64()
 * (string) packageName
 */
 
var menulist = ["청국장찌개", "순두부찌개", "고추장찌개","부대찌개","김치찌개","된장찌개","비지찌개","전찌개","동태찌개","갈비찜","닭볶음탕","스테이크","아귀찜","삼계탕","수육","월날쌈","불고기","찜닭","제육덮밥","비빔밥","오므라이스","카레덮밥","김치볶음밥","오징어덮밥","짜장밥","야채볶음밥","간장밥","육개장","떡국","미역국","콩나물국","북엇국","소고기무국","시래깃국","된장국","감잣국","튀김","소시지야채볶음","골뱅이소면","부침개","어묵탕","닭똥집볶음","순대볶음","토스트","또띠아","떡꼬치","쿠키","떡볶이","호떡","샌드위치","시리얼","팝시클","라면","토마토스파게티","크림스파게티","봉골레스파게티","잔치국수","비빔국수","칼국수","우동","볶음우동","콩국수","전복죽","추어탕","장어구이","낙지연포탕","갈비탕","훈제오리","닭죽","삼계탕","더덕구이","오니기리","캘리포니아롤","스시","유부초밥","밥버거","스팸","볶음밥","투움바파스타","김밥","알로하김밥","호두크림치즈김밥","바나나쉐이크","닭가슴살샐러드","리코타치즈","단호박스프","양배추스프","두부스테이크","연어덮밥","오차즈케","불고기브리또","샐러드파스타","크로크무슈","몬테크리스토","팬케이크","치킨마요덮밥","오믈렛","프렌치토스트","조개스프","에그베네딕트","만둣국","떡국","라자냐","칠리새우","잡채","누룽지","고추장찌개","포테이토피자","냉채라면","짜파구리","진라면","달걀","야채볶음","프리타타","계란말이","계란찜","스카치에그","스터프드에그","깐풍기","탕수육","두루치기","제육볶음","동파육","중국집볶음밥","잡채밥","짬뽕밥","짬뽕","삼선짜장","삼선짬뽕","쟁반짜장","닭갈비","치킨까스","돈까스","치즈돈까스","고구마치즈돈까스","주먹밥","리조또","크로켓","덴푸라","가츠동","하이라이스","오코노미야끼","미소시루","우동","규동","라멘","마파두부","고추잡채","곱창","막창","대창","해물파전","파전","쌈밥","칼국수","수제비","팥죽","그라탕","뇨끼","나폴리피자","페투치니알프레도","파니니","팟타이","카오팟","나시고랭","쌀국수","연유라떼","분짜","짜조","반미(바게트샌드위치)","허머스","팔라펠","케밥","삭슈카","페투쉬","필라프","쿠스쿠스","피타","무사카","맥앤치즈","클램차우더","핫도그","햄버거","불고기버거","빅맥","상하이버거","미트로프","후라이드치킨","양념치킨","간장치킨","닭강정","잠발라야","바비큐","라타투이","프렌치토스트","뵈프부르기뇽","뱅쇼","크로크무슈","마카롱","부야베스","끼슈","코코뱅","가리가리군", "가리비", "거북알", "거북이", "고드름", "구구콘", "깐도리", "꽃게랑", "누가바", "대롱대롱", "더블비얀코", "더위사냥", "돼지바", "마카롱아이스바", "말랑카우", "메로나", "바밤바", "보석바", "부라보콘", "붕어싸만코", "비비빅", "빅바", "빙빙바", "빠삐코", "빵또아", "빵빠레", "뽕따", "설레임", "셀렉션", "슈퍼콘", "쌍쌍바", "아맛나", "아시나요", "아이스파인", "엑설런트", "엔초", "요맘때", "옥메와까", "옥동자", "메가톤바", "와일드바디", "까마쿤", "와(아이스크림)", "와삭바", "울퉁불퉁", "월드콘", "조안나", "죠크박", "죠스바", "스크류바", "수박바", "쮸쮸바", "찬호박", "찰떡아이스", "캔디바", "쿠앤크", "쿠키오", "탱크보이", "테트리스", "토끼", "투게더", "티코", "폴라포", "하겐다즈", "호두마루", "홈런볼 아이스", "하겐다즈", "레드망고", "나뚜루", "구스띠모", "베스킨라빈스31","롯데리아","맥도날드","치즈버거","버거킹","족발","백숙","삼겹살","보쌈","육회","육사시미","육회비빔밥","순대","홍어회","물회","굴비","매운탕","북엇국","해물찜","오징어볶음","아귀찜","골뱅이무침","빈대떡","호박전","육전","동래파전","수제비","떡국","떡만둣국","시래기국","선지국","순댓국","소머리국밥","콩나물국밥","화채","토란국","재첩국","곰탕","닭곰탕","설렁탕","연포탕","닭도리탕","고기국수","막국수","비빔국수","김치말이국수","칼국수","초계국수","도토리묵","밀면","냉면","찹쌀도넛","회오리감자","너비아니","뒷고기","전복죽","야채죽"];

function response(room, msg, sender, isGroupChat, replier, imageDB, packageName) {

  if(msg.replace(/ /g, '').indexOf('머먹') > -1 || msg.replace(/ /g, '').indexOf('뭐먹') > -1) {
      
    var menuNum = Math.floor(Math.random() * menulist.length);
    replier.reply('오늘은 이거 먹어라 ' + menulist[menuNum] + ' 츄릅');
  }
  
}

//아래 4개의 메소드는 액티비티 화면을 수정할때 사용됩니다.
function onCreate(savedInstanceState, activity) {
  var textView = new android.widget.TextView(activity);
  textView.setText("Hello, World!");
  textView.setTextColor(android.graphics.Color.DKGRAY);
  activity.setContentView(textView);
}

function onStart(activity) {}

function onResume(activity) {}

function onPause(activity) {}

function onStop(activity) {}